package homework5;

/**
 * @author Rustam Khakov
 */
public class Task09 {
    //Дан целочисленный массив nums, переместите все 0 в его конец, сохраняя относительный порядок ненулевых элементов.
    // Входной массив [0,1,0,3,12] Выходной: [1,3,12,0,0] Оцените асимптотическую сложность алгоритма по памяти и по времени,
    // попробуйте уменьшить количество используемой памяти
    public static void main(String[] args) {
        // time - O(n), memory - O(n) [1,3, 12, 0, 0]
        // time - O(n), memory - O(1) [1,3,12,14,0, 0,0,2,5,0,2]
        //                      first           ^
        //                      i                       ^
    }
}
